INSERT INTO table_product(name, stock)
VALUES ('Яблоко', 100),
       ('Банан', 50),
       ('Груша', 30),
       ('Апельсин', 75);

INSERT INTO table_price_history(product_id, price, change_date)
VALUES (1, 50, '2026-04-20'),
       (1, 55, '2026-04-22'),
       (1, 52, '2026-04-24'),

       (2, 30, '2026-04-20'),
       (2, 32, '2026-04-23'),

       (3, 40, '2026-04-21'),
       (3, 45, '2026-04-24'),

       (4, 60, '2026-04-19'),
       (4, 58, '2026-04-24');



INSERT INTO table_sales(product_id, buyer, sale_date)
VALUES (1, 'Иван', '2026-04-24'),
       (1, 'Мария', '2026-04-24'),
       (2, 'Иван', '2026-04-24'),
       (3, 'Петр', '2026-04-24'),
       (4, 'Анна', '2026-04-24'),
       (1, 'Сергей', '2026-04-24'),
       (2, 'Мария', '2026-04-24');